<!-- terraform cdk action for options with hash b40773fd8c7287889cb5c3cdc1250b71 -->
### ✅ Successfully applied Terraform CDK Stack 'cdktf'



<details><summary>Show Run</summary>

```shell
... Output truncated to the last 65000 characters ...

e           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa" -> (known after apply)
             ~ system_tags                         = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> (known after apply)
             ~ time_created                        = "2024-09-22 01:27:59.369 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.904Z"
                   } -> (known after apply)
                 ~ display_name              = "healthchecks" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.104" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
cdktf  }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 1 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
                 ~ vcpus                         = 2 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key) will be created
         + resource "tailscale_tailnet_key" "tailscale_auth_key" {
             + created_at    = (known after apply)
             + ephemeral     = false
             + expires_at    = (known after apply)
             + id            = (known after apply)
             + invalid       = (known after apply)
             + key           = (sensitive value)
             + preauthorized = true
             + reusable      = true
             + tags          = [
                 + "tag:cdktf",
                 + "tag:oci",
                 + "tag:ssh",
               ]
           }

       Plan: 5 to add, 7 to change, 4 to destroy.

       Changes to Outputs:
         ~ oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07                                          = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq" -> (known after apply)
         ~ oci1_oci1-vault-compute_instance-source-details_49B43EF8                                       = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-boot-volume_56D85552      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> (known after apply)
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-source-details_EBF73E6F   = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq" -> (known after apply)
cdktf  ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA         = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6    = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq" -> (known after apply)
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }

       Post-plan Tasks:
cdktf  All tasks completed! 1 passed, 0 failed           (4s elapsed)

       │ Snyk ⸺   Passed
       │ No issues found.
       Severity threshold is set to low.
       │ Details: https://app.snyk.io/org/jon77p/project/0fe83cb2-98ca-4577-b078-fd048f4c1e02/history/86427ac6-1fcd-4527-a88f-5b5a4e0af602
       │
       │
       │ Overall Result: Passed

       ------------------------------------------------------------------------
cdktf  ------------------------------------------------------------------------

       Cost Estimation:

       Resources: 0 of 66 estimated
                  $0.0/mo +$0.0

       ------------------------------------------------------------------------
cdktf
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Modifying... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Modifying... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Modifying... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Destroying... [id=ocid1.instance.oc1.phx.anyhqljrvaxvekyctfk4lsyiblugfachhplrasfusaszm7x4f53efdtgxkwa]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Destroying... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3t2kkplfdii2zpd7jkvj7mwfjqj6goqtgklx2laaeuwa]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Destroying... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyci7xoin6qkpuxgmw3woshmyd5cx4grhqcr43rzhd64ocq]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Destroying... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3dzxrjju2m3t6rgokupwfjp2vivcniyhqnb4p3ecuuva]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Modifications complete after 2s [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Modifications complete after 2s [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Modifications complete after 2s [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still destroying... [10s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [10s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still destroying... [20s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [20s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [20s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still destroying... [30s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [30s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [30s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [30s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still destroying... [40s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [40s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [40s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [40s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still destroying... [50s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [50s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [50s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [50s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Destruction complete after 55s
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still destroying... [1m0s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still destroying... [1m0s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still destroying... [1m0s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Destruction complete after 1m5s
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Destruction complete after 1m5s
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Destruction complete after 1m5s
cdktf  tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Creating...
cdktf  tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Creation complete after 8s [id=kvDWv6QkTp11CNTRL]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Creating...
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Creating...
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Creating...
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Creating...
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [10s elapsed]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still creating... [10s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [10s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [20s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still creating... [20s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [30s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [30s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Still creating... [30s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [30s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Creation complete after 36s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyc4i5zimpis6kfaudjarkxity22dc7pqkw4pw2p34wpxua]
       cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Modifying... [id=b08082b9ad457e047dd24056901770b3]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Creation complete after 36s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyckplkfhutuzvg36sz2qy64ung67wczgc6lz7jp2bvjfyq]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Modifying... [id=63167681b29dd7c53160cea2ad0221b1]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Creation complete after 36s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyckmvnlpax55rlj3jxgd74upxm4a7zbs74efimm2dmlhba]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Modifying... [id=088bc807ead737ed3fa6983fbc7ebfd4]
       cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Modifications complete after 1s [id=b08082b9ad457e047dd24056901770b3]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Modifications complete after 1s [id=63167681b29dd7c53160cea2ad0221b1]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Creation complete after 37s [id=ocid1.instance.oc1.phx.anyhqljrvaxvekyc2pnmqno6uoedbtwjy2ss4oye4bbywbp3eqvplauncrxq]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-record): Modifying... [id=9e38842f8d30d2fbb8adf3eb496e45a9]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Modifications complete after 1s [id=088bc807ead737ed3fa6983fbc7ebfd4]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-record): Modifications complete after 1s [id=9e38842f8d30d2fbb8adf3eb496e45a9]

       Apply complete! Resources: 5 added, 7 changed, 4 destroyed.
cdktf  Outputs:
       oci0_oci0-base_public-subnet-id_9A1A879F = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-source-details_EBF73E6F = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = true
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq"
               source_type                          = "bootVolume"
           }
       oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-id_3E815125 = "ocid1.subnet.oc1.phx.aaaaaaaadhungsdaobawobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_boot-volumes_E66EF43B = {
               availability_domain = "EHXP:PHX-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "EHXP:PHX-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-09-21T01:30:10.946Z"
                       }
                       display_name                  = "monitoring (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq"
                       image_id                      = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {}
                       time_created                  = "2024-09-21 01:30:14.651 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                       xrc_kms_key_id                = null
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "monitoring",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2286997786"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-name_C2213F6C = "public"
       oci0_oci0-base_vcn-dns_label_5BD2D3FC = "oci0"
       oci1_oci1-base_public-subnet-dns_label_188893EF = "public"
       oci1_oci1-base_public-subnet-name_2D463AED = "public"
       oci0_oci0-base_vcn-domain_name_38DDC26E = "oci0"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-dns_label_FBF0A2EB = "oci2ussanjose1"
cdktf  oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-id_2596B2F0 = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-name_B8FBE865 = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-display-name_336862EB = "monitoring"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-display-name_A0476686 = "auth"
       oci1_oci1-base_private-subnet-id_05823730 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatyttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq"
       oci1_oci1-base_private-subnet-subnet_domain_name_2A413BB8 = "private.oci1.oraclevcn.com"
       oci1_oci1-base_vcn-domain_name_9E902338 = "oci1"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-hostname_8249F6C5 = "auth"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-id_899CBFD3 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-display-name_03D6715F = "healthchecks"
       oci0_compartment-name_F137ABE4 = "terraform"
       oci1_oci1-vault-compute_instance-display-name_F6EA6C63 = "vault"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-hostname_859C06CE = "monitoring"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-name_35C33192 = "private"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = true
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
               source_type                          = "bootVolume"
           }
       oci0_oci0-base_private-subnet-id_F89DF5A3 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaixrvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq"
       oci0_oci0-base_public-subnet-dns_label_32471719 = "public"
       oci1_oci1-base_public-subnet-id_4C674F6E = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-id_4C672C2B = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-domain_name_116AD8DF = "oci2ussanjose1"
       oci0_oci0-base_public-subnet-name_351090EA = "public"
       oci1_oci1-base_public-subnet-subnet_domain_name_B020D888 = "public.oci1.oraclevcn.com"
       oci1_oci1-vault-compute_instance-hostname_7D8AAC00 = "vault"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-dns_label_79348ED2 = "private"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_boot-volumes_8751F307 = {
               availability_domain = "EHXP:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "EHXP:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-20T06:25:16.626Z"
                       }
                       display_name                  = "healthchecks (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
cdktf  image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
                       time_created                  = "2024-07-20 06:25:20.141 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                       xrc_kms_key_id                = null
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "healthchecks",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2744709155"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
       oci0_oci0-base_vcn-id_87BF955B = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5na6fgukt55idgvuwz6oxuxppchwkucykqkpya"
       oci0_oci0-base_vcn-name_F14385C6 = "terraform"
       oci1_oci1-vault-compute_boot-volumes_3DBAA598 = {
               availability_domain = "JFCW:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "JFCW:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-09-17T18:02:34.112Z"
                       }
                       display_name                  = "vault (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
                       image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
                       time_created                  = "2024-09-17 18:02:35.681 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                       xrc_kms_key_id                = null
                   },
               ]
cdktf  compartment_id      = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "vault",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2062574658"
           }
       oci1_oci1-base_vcn-name_209984E2 = "terraform"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-dns_label_E6A0F7BA = "public"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-hostname_AA05D714 = "healthchecks"
       oci0_oci0-base_private-subnet-name_15841A41 = "private"
       oci1_oci1-base_vcn-dns_label_DEF24157 = "oci1"
       oci1_oci1-base_vcn-id_C8BF21A0 = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r7byz5coah7q3ydm5td2tqospnrarqfdladzq"
       oci2_compartment-name_68FE8D8C = "terraform"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = true
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
               source_type                          = "bootVolume"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-subnet_domain_name_0DD664B2 = "public.oci2ussanjose1.oraclevcn.com"
       oci0_oci0-base_public-subnet-subnet_domain_name_46910400 = "public.oci0.oraclevcn.com"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-id_2468E7D5 = "ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpgwdszc5hmqlc6ymzzt2tfmpo4f7a"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_boot-volumes_21834E5A = {
               availability_domain = "EHXP:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "EHXP:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-20T06:25:17.014Z"
                       }
                       display_name                  = "auth (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
                       image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
cdktf  time_created                  = "2024-07-20 06:25:20.152 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                       xrc_kms_key_id                = null
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "auth",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2744709155"
           }
       oci1_compartment-id_6C8E0FD1 = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
       oci1_oci1-base_private-subnet-dns_label_5617DF08 = "private"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-dns_label_60224B99 = "private"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-domain_name_98E64554 = "oci2usphoenix1"
       oci0_oci0-base_private-subnet-dns_label_7DC660C8 = "private"
       oci1_oci1-vault-compute_instance-source-details_49B43EF8 = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = true
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
               source_type                          = "bootVolume"
           }
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-subnet_domain_name_A46C5FF7 = "public.oci2usphoenix1.oraclevcn.com"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-subnet_domain_name_28EE43F3 = "private.oci2ussanjose1.oraclevcn.com"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-id_B34A7208 = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5ifhvhrlao2jyu74eyk5usszmyf3waetjsx4rmq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-name_D9A0FD65 = "terraform"
       oci0_compartment-id_B2E21DF0 = "ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq"
       oci1_oci1-base_private-subnet-name_CE12CFFA = "private"
       oci2_compartment-id_EBEB4B5A = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-name_F9DCE311 = "private"
       oci0_oci0-base_private-subnet-subnet_domain_name_3FE2550C = "private.oci0.oraclevcn.com"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-subnet_domain_name_E92DE5FC = "private.oci2usphoenix1.oraclevcn.com"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-dns_label_E59F27FB = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-boot-volume_56D85552 = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq"
       oci1_compartment-name_C32368C8 = "terraform"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-dns_label_01E8A435 = "oci2usphoenix1"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-name_CA5B3A39 = "terraform"

  cdktf
    oci0
      compartment-id = ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdj
      xpn52f6dwzdwd7vgivsk65q6vq
      compartment-name = terraform
        oci0
              oci0-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaix
                    rvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci0.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c
                    6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq
                    public-subnet-name = public
                    public-subnet-subnet_domain_name = public.oci0.oraclevcn.com
                    vcn-dns_label = oci0
                    vcn-domain_name = oci0
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5n
                    a6fgukt55idgvuwz6oxuxppchwkucykqkpya
                    vcn-name = terraform



    oci1
      compartment-id = ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnkto
      xgy7n47xekua6k2aeycrumdpda
      compartment-name = terraform
        oci1
              oci1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaty
                    ttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy
                    2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea
                    public-subnet-name = public
                    public-subnet-subnet_domain_name = public.oci1.oraclevcn.com
                    vcn-dns_label = oci1
                    vcn-domain_name = oci1
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r
                    7byz5coah7q3ydm5td2tqospnrarqfdladzq
                    vcn-name = terraform

              oci1-vault-compute
                    boot-volumes = {
                      "availability_domain": "JFCW:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "JFCW:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaabmom
                    hkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon77.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-09-17T18:02:34.112Z"
                          },
                          "display_name": "vault (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozyw
                    d2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-09-17 18:02:35.681 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10",
                          "xrc_kms_key_id": ""
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaabmomhktt
                    vm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "vault"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2062574658",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq
                    instance-display-name = vault
                    instance-hostname = vault
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": true,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreo
                    zywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq",
                      "source_type": "bootVolume"
                    }



    oci2
      compartment-id = ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnk
      mww62yhftzhyh5k7qncv77x2eq
      compartment-name = terraform
        oci2-us-phoenix-1
              oci2-us-phoenix-1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.phx.aaaaaaaadhungsdaoba
                    wobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci2usphoenix1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm
                    7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna
                    public-subnet-name = public
                    public-subnet-subnet_domain_name =
                    public.oci2usphoenix1.oraclevcn.com
                    vcn-dns_label = oci2usphoenix1
                    vcn-domain_name = oci2usphoenix1
                    vcn-id = ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpg
                    wdszc5hmqlc6ymzzt2tfmpo4f7a
                    vcn-name = terraform

              oci2-us-phoenix-1-monitoring-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:PHX-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:PHX-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-09-21T01:30:10.946Z"
                          },
                          "display_name": "monitoring (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uh
                    nn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq",
                          "image_id": "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5p
                    rnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {},
                          "time_created": "2024-09-21 01:30:14.651 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10",
                          "xrc_kms_key_id": ""
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "monitoring"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2286997786",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.phx.abyhqljrmoce
                    due3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq
                    instance-display-name = monitoring
                    instance-hostname = monitoring
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": true,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn
                    6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq",
                      "source_type": "bootVolume"
                    }


        oci2-us-sanjose-1
              oci2-us-sanjose-1-auth-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-20T06:25:17.014Z"
                          },
                          "display_name": "auth (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3em
                    tljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-07-20 06:25:20.152 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10",
                          "xrc_kms_key_id": ""
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "auth"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2744709155",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq
                    instance-display-name = auth
                    instance-hostname = auth
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": true,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk
                    3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq",
                      "source_type": "bootVolume"
                    }

              oci2-us-sanjose-1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr
                    2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci2ussanjose1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5
                    jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa
                    public-subnet-name = public
                    public-subnet-subnet_domain_name =
                    public.oci2ussanjose1.oraclevcn.com
                    vcn-dns_label = oci2ussanjose1
                    vcn-domain_name = oci2ussanjose1
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5if
                    hvhrlao2jyu74eyk5usszmyf3waetjsx4rmq
                    vcn-name = terraform

              oci2-us-sanjose-1-healthchecks-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-20T06:25:16.626Z"
                          },
                          "display_name": "healthchecks (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptu
                    okej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-07-20 06:25:20.141 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10",
                          "xrc_kms_key_id": ""
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "healthchecks"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2744709155",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq
                    instance-display-name = healthchecks
                    instance-hostname = healthchecks
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": true,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4
                    ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq",
                      "source_type": "bootVolume"
                    }





```

</details>